//企业发放的奖金根据利润提成:
//利润(I)低于或等于10万元时,奖金可提10%;
//利润高于10万元,低于20万元时,低于10万元的部分按10%提成,高于10万元的部分,可提成7.5%;
//20万到40万之间时,高于20万元的部分,可提成5%;
//40万到60万之间时高于40万元的部分,可提成3%;
//60万到100万之间时,高于60万元的部分,可提成1.5%; 
//高于100万元时,超过100万元的部分按1%提成.从键盘输入当月利润I,求应发放奖金总数？
#include <stdio.h>
int main(void)
{
	float reward,I;
	int r1=10000,r2=7500,r3=10000,r4=6000,r5=6000;//r1表示10万的提成,r2表示10到20万的提成,
	printf("请输入利润I:");		// r3表示20到40万的提成,r4表示40到60万的提成,r5表示60到100万的提成 
	scanf("%f",&I);
	if(I<=100000)	//分支讨论 
		reward=I+I*0.1;
	else if(100000<I<=200000)
		reward=r1+(I-100000)*0.075+I;
	else if(200000<I<=400000)
		reward=r1+r2+(I-200000)*0.05+I;
	else if(400000<I<=600000)
		reward=r1+r2+r3+(600000-I)*0.03+I;
	else if(600000<I<=1000000)
		reward=r1+r2+r3+r4+(I-600000)*0.015+I;
	else
		reward=r1+r2+r3+r4+r5+(I-1000000)*0.01+I;
	printf("当利润为%.2f时,奖金为%.2f",I,reward);
	return 0;
} 
